Repository: Sunshine-Web-dev/trendr
Catalog: trm-src/module/trendr-followers-1.2.2/languages/trs-follow-*.po
Languages: de_de, pt_br

source: Follow
de_de: Folgen
pt_br: Seguir

source: Following <span>%d</span>
de_de: Ich folge <span>%d</span>
pt_br: Seguindo <span>%d</span>

source: Followers <span>%d</span>
de_de: Mir folgen <span>%d</span>
pt_br: Seguidores <span>%d</span>

# Activity subnav tab
source: Following
pt_br: Seguindo

# Adminbar main nav
source: Follow
pt_br: Seguir

# Adminbar follow subnav
source: Following
pt_br: Seguindo

# Adminbar follow subnav
source: Followers
pt_br: Seguidores

# Adminbar activity subnav
source: Following
pt_br: Seguindo

source: Hey! TRS Follow v1.2 requires trendr 1.5 or higher. If you are still using trendr 1.2 and you don't plan on upgrading, use <a href='%s'>TRS Follow v1.1.1 instead</a>.
de_de: TRS Follow v1.2 benötigt trendr v1.5 oder höher. Alternativ <a href='%s'>TRS Follow v1.1.1</a> verwenden.
pt_br: Hey! TRS Follow v1.2 exige o BuddyyPress 1.5 ou uma versão mais recente. Se você ainda está usando o trendr 1.2 e não tem planos de atualizar, use a versão <a href='%s'>TRS Follow v1.1.1</a>.

source: You are already following %s.
de_de: Du folgst %s.
pt_br: Você já está seguindo %s.

source: There was a problem when trying to follow %s, please try again.
de_de: Fehler beim Versuch %s zu folgen, bitte erneut versuchen.
pt_br: Houve um problema ao tentar seguir %s, por favor, tente novamente.

source: You are now following %s.
de_de: Du folgst nun %s.
pt_br: Você está seguindo agora %s.

source: You are not following %s.
de_de: Du folgst %s nicht.
pt_br: Você não está seguindo %s.

source: There was a problem when trying to stop following %s, please try again.
de_de: Fehler beim Versuch %s nicht länger zu folgen, bitte erneut versuchen.
pt_br: Houve um problema ao tentar parar de seguir %s, por favor, tente novamente.

source: You are no longer following %s.
de_de: Du folgst nicht länger %s.
pt_br: Você não está mais seguindo %s.

source: %1$s | %2$s | Following Activity
pt_br: %1$s | %2$s | Seguindo Atividade

source: Activity feed for people that %s is following.
pt_br: Feed de atividade para pessoas que %s está seguindo.

source: Already following
de_de: Du folgst bereits
pt_br: Já está seguindo

source: Error following user
de_de: Fehler beim Folgen
pt_br: Error ao seguir usuário

source: Not following
de_de: Ich folge nicht
pt_br: Não está seguindo

source: Error unfollowing user
de_de: Folgen konnte nicht beendet werden
pt_br: Error ao parar de seguir usuário

source: The public activity for everyone you are following on this site.
de_de: Die öffentlichen Aktivitäten von jedem dem Du auf dieser Seite folgst.
pt_br: A atividade pública para todos que você está seguindo neste site.

source: You are following some users, but they haven't posted yet.
pt_br: Você está seguindo alguns usuuários, mas eles não publicaram ainda.

source: You are not following anyone yet.
pt_br: Você não está seguindo ninguém ainda.

source: This user is following some users, but they haven't posted yet.
pt_br: Este usuário está seguindo alguns usuários, mas eles não postaram ainda.

source: This user isn't following anyone yet.
pt_br: Este usuário não está seguindo ninguém ainda.

source: %s is now following you
de_de: %s folgt Dir nun
pt_br: %s está seguindo vcê agora

source: %d more users are now following you
de_de: %d neue Benutzer folgen Dir
pt_br: %d mais usuários estão lhe seguindo agora

source: Yes
de_de: Ja
pt_br: Sim

source: No
de_de: Nein
pt_br: Não

source: A member starts following your activity
de_de: Ein Benutzer verfolgt Deine Aktivitäten
pt_br: Um membro começou a seguir sua atividade

source: %s is now following your activity. To view %s's profile: %s
pt_br: %s está seguindo sua atividade agora. Para visualizar perfil do %'s : %s

source: --------------------- To disable these notifications please log in and go to: %s
pt_br: --------------------- Para desabilitar essas notificações, por favor, logue e vá para: %s

source: Order By:
de_de: Sortiere nach:
pt_br: Ordenar por:

source: Last Active
de_de: Zuletzt aktiv
pt_br: Atividade Recente

source: Newest Registered
de_de: Zuletzt registriert
pt_br: Recém-registrado

source: Alphabetical
de_de: Alphabetisch
pt_br: Ordem Alfabética

# Button
source: Unfollow
pt_br: Deixar de Seguir

# Button
source: Follow
pt_br: Seguir

source: Show a list of member portraits that the logged-in user is following.
de_de: Zeige eine Avatar Liste von Mitgliedern denen der Benutzer folgt.
pt_br: Mostrar uma lista de portraits de membros que o usuário logado está seguindo.

source: (TRS Follow) Users I'm Following
de_de: (TRS Follow) Benutzer denen ich folge
pt_br: (TRS Follow) Usuários que Estou Seguindo

source: Users I'm Following
de_de: Benutzer denen ich folge
pt_br: Usuários que Estou Seguindo

source: Title:
de_de: Titel:
pt_br: Título:

source: Max members to show:
de_de: Max. Mitglieder anzeigen:
pt_br: Mostrar número maximo de membros:

source: Note: This widget is only displayed if a member is logged in and if the logged-in user is following some users.
de_de: Hinweis: Das Widget wird nur angezeigt wenn ein Mitglied eingeloggt ist und jemandem folgt.
pt_br: Nota: Este widget é mostrado apenas se um usuário estiver logado e se um usuário logado estiver seguindo alguns usuários.

source: You are now following
de_de: Du folgst ab jetzt

source: Stopped following
de_de: Ich folge nicht länger

source: 1 more user is now following you
de_de: 1 neuer Benutzer folgt Dir

source: Your list of followers
de_de: Wer Dir folgt

source: Stop Following %s
de_de: %s nicht mehr folgen

source: Follow %s
de_de: Folge %s

source: Following
de_de: Ich folge

source: Followers
de_de: Mir folgen
