Repository: Sunshine-Web-dev/trendr
Catalog: trm-src/module/file-cache/lang/sjfilecache-*.po
Languages: be_by, ru_ru, uk_ua

source: TRM File Cache Options
be_by: Налады TRM File Cache
ru_ru: Настройки TRM File Cache
uk_ua: Налаштування TRM File Cache

source: You don't have enough privileges to do this
be_by: У Вас нядосыць мае рацыю для выканання дадзенай аперацыі
ru_ru: У Вас недостаточно прав для выполнения данной операции
uk_ua: У вас недостатньо прав для виконання цієї операції

source: %1$s does not exist. Please make sure that %2$s is writable by the server.
be_by: %1$s не існуе. Упэўніцеся, што ў сервера ёсць правы на запіс у %2$s
ru_ru: %1$s не существует. Убедитесь, что у сервера есть права на запись в %2$s
uk_ua: %1$s не існує. Перевірте, будь ласка, чи має сервер права на запис в %2$s.

source: Settings have been successfully updated
be_by: Налады былі паспяхова захаваныя
ru_ru: Настройки были успешно сохранены
uk_ua: Налаштування було успішно збережено

source: Unable to write to file %s. Please make sure that it is writable by the server.
be_by: Немагчыма запісаць у файл %s. Упэўніцеся, што ў сервера ёсць правы на запіс у дадзены файл.
ru_ru: Невозможно записать в файл %s. Убедитесь, что у сервера есть права на запись в данный файл.
uk_ua: Неможливо записати в файл %s. Будь ласка, перевірте, чи має сервер права на запис в цей файл.

source: Cache directory does not exist!
be_by: Каталог для кэша не існуе!
ru_ru: Каталог для кэша не существует!
uk_ua: Тека для кешу не існує!

source: Cache directory must be readable and writable by the server!
be_by: Сервер павінен мець правы на чытанне і запіс каталога для кэша
ru_ru: Сервер должен иметь права на чтение и запись каталога для кэша
uk_ua: Серверу потрібно надати права на читання і запис в теку для кешу

source: Cache has been successfully purged
be_by: Кэш быў паспяхова скінуты
ru_ru: Кэш был успешно сброшен
uk_ua: Кеш було успішно очищено

source: Enable TRM File Cache
be_by: Уключыць File Cache
ru_ru: Включить File Cache
uk_ua: Включити TRM File Cache

source: Disabling TRM File Cache can make Trnder crawl!
be_by: Адключэнне TRM File Cache можа негатыўна адбіцца на прадукцыйнасці Trnder!
ru_ru: Отключение TRM File Cache может негативно сказаться на производительности Trnder!
uk_ua: Відключення TRM File Cache може призвести до зниження швидкості роботи Trnder!

source: If you disable TRM File Cache, caching will be completely disabled, and Trnder will have to use the database every time it needs data. This is really slow. If you are not a Trnder developer, please do not do this.
be_by: Пры адключэнні TRM File Cache кэшаванне будзе цалкам забароненае, і Trnder прыйдзецца звяртацца да базы дадзеных штораз, калі яму неабходныя дадзеныя. Гэта сапраўды вельмі павольна. Калі Вы не з'яўляецеся распрацоўнікам Trnder, адключэнне дадзенай опцыі не рэкамендуецца.
ru_ru: При отключении TRM File Cache кэширование будет полностью запрещено, и Trnder придётся обращаться к базе данных каждый раз, когда ему необходимы данные. Это действительно очень медленно. Если Вы не являетесь разработчиком Trnder, отключение данной опции не рекомендуется.
uk_ua: Якщо відключити TRM File Cache, Trnder буде звертатися до бази даних кожного разу, коли потрібні дані, а це дійсно повільна операція. Якщо ви не є розробником Trnder, таке відключення не рекомендується.

source: Save cached data across sessions
be_by: Захоўваць кэш паміж сесіямі
ru_ru: Сохранять кэш между сессиями
uk_ua: Зберігати дані кешу проміж сесій (тобто для можливості використання в наступних викликах)

source: If this option is set, TRM File Cache will maintain its cache between sessions to improve overall performance. Actually, this is what this plugin was made for and we strongly recommend that you don't turn this option off.
be_by: Калі дадзеная опцыя ўключаная, TRM File Cache будзе захоўваць кэш паміж сесіямі, што дазволіць павялічыць прадукцыйнасць сістэмы. Гэта менавіта то, для чаго убудова быў створаны, і мы вельмі не рэкамендуемы адключаць гэтую опцыю.
ru_ru: Если данная опция включена, TRM File Cache будет сохранять кэш между сессиями, что позволит увеличить производительность системы. Это именно то, для чего плагин был создан, и мы очень не рекомендуем отключать эту опцию.
uk_ua: Якщо цю опцію включено, TRM File Cache буде зберігати дані в кеші проміж сесій, що дозволяє збільшити швідкість роботи сайта, і саме це є метою, з якою плагін було створено! Тому дуже не рекомендуємо відключати цю опцію.

source: <strong>Boring technical details:</strong> TRM File Cache will save only those data that were not marked as 'non-persistent'.
be_by: <strong>Сумныя тэхнічныя падрабязнасці:</strong> TRM File Cache не будзе захоўваць дадзеныя, відавочна адзначаныя як 'не дзейнікі захоўванню'.
ru_ru: <strong>Скучные технические подробности:</strong> TRM File Cache не будет сохранять данные, явно отмеченные как 'не подлежащие хранению'.
uk_ua: <strong>Докучливі технічні подробиці:</strong> TRM File Cache буде зберігати тільки такі дані, які НЕ було явно вказано как 'тимчасові'.

source: Cache location
be_by: Размяшчэнне кэша
ru_ru: Расположение кэша
uk_ua: Місцезнаходження кешу

source: This is the directory where TRM File Cache will store its cache.
be_by: Каталог, у якім TRM File Cache будзе захоўваць кэш.
ru_ru: Каталог, в котором TRM File Cache будет хранить кэш.
uk_ua: Це тека, в якій TRM File Cache буде зберігати кеш.

source: <strong>Please note:</strong> this directory must be writable by the web server.
be_by: <strong>Увага:</strong> сервер павінен мець правы на запіс у дадзены каталог.
ru_ru: <strong>Внимание:</strong> сервер должен иметь права на запись в данный каталог.
uk_ua: <strong>Увага:</strong> серверу потрібно мати права на запис в цю теку.

source: <strong>Security notice:</strong> it is advisable that you keep this directory outside the root of your site to make it inaccessible from the web. If this is not an option, consider restricting access to that directory.
be_by: <strong>Заўвага па бяспецы:</strong> мы рэкамендуем выкарыстаць каталог, змешчаны па-за коранем web-сервера, каб дадзеныя не былі даступныя з Internet. Калі па тых або іншых чынніках гэта немагчыма, паспрабуйце абмежаваць доступ да кэша.
ru_ru: <strong>Замечание по безопасности:</strong> мы рекомендуем использовать каталог, находящийся вне корня web-сервера, чтобы данные не были доступны из Internet. Если по тем или иным причинам это невозможно, попытайтесь ограничить доступ к кэшу.
uk_ua: <strong>Зауваження з безпеки:</strong>рекомендуемо вказати теку, яку розташовано за кореневою текою web-сервера, щоб кеш було неможливо переглянути будь-кому з інтернет. Якщо таке безпечне розташування неможливо, тоді спробуйте обмежити доступ до кешу якимось іншім способом.

source: <strong>For Linux geeks:</strong> consider placing the cache to <code>tmpfs</code> file system (or <code>/dev/shm</code>) — this should make things faster.
be_by: <strong>Для Лінуксоідаў:</strong> размяшчайце кэш на файлавай сістэме <code>tmpfs</code> (або <code>/dev/shm</code>) — гэта павінна палепшыць прадукцыйнасць.
ru_ru: <strong>Для Линуксоидов:</strong> размещайте кэш на файловой системе <code>tmpfs</code> (или <code>/dev/shm</code>) — это должно улучшить производительность.
uk_ua: <strong>Для лінуксоїдів:</strong> розміщайте кеш в файловій системі <code>tmpfs</code> (або <code>/dev/shm</code>) — це може збільшити швидкість роботи.

source: Do not use cache in the Admin Panel
uk_ua: Не застосовувати кеш в адмін-панелі

source: If this option is set, TRM File Cache will not fetch the data from the cache in the Admin Panel. However, to keep the cache consistent, write cache requests will be satisfied.
uk_ua: Якщо включено, тоді в адмін-панелі плагін не буде застосовувати дані з кешу, але, щоб зберегти цілісність кешу, буде записувати до нього нові дані (якщо є).

source: Non-persistent groups
be_by: Несохраняемые групы
ru_ru: Несохраняемые группы
uk_ua: Тимчасові групи

source: Comma-separated list of the cache groups which should never be stored across sessions.
be_by: Пералік груп, падзеленых коскамі, якія не павінны захоўвацца паміж сесіямі.
ru_ru: Перечень групп, разделённых запятыми, которые не должны сохраняться между сессиями.
uk_ua: Перелік груп кешу (через кому), які не слід зберігати проміж сесій.

source: Save Changes
be_by: Захаваць змены
ru_ru: Сохранить изменения
uk_ua: Зберегти зміни

source: Purge Cache
be_by: Ачысціць кэш
ru_ru: Очистить кэш
uk_ua: Очистити кеш

source: Are you sure?
be_by: Вы ўпэўненыя?
ru_ru: Вы уверены?
uk_ua: Ви впевнені?
